# 唯一摩尔斯密码词

# 国际摩尔斯密码定义一种标准编码方式，将每个字母对应于一个由一系列点和短线组成的字符串， 比如: "a" 对应 ".-", "b" 对应 "-...", "c" 对应 "-.-.", 等等。
# 为了方便，所有26个英文字母对应摩尔斯密码表如下：
# [".-","-...","-.-.","-..",".","..-.","--.","....","..",".---","-.-",".-..","--","-.","---",".--.","--.-",".-.","...","-","..-","...-",".--","-..-","-.--","--.."]
# 给定一个单词列表，每个单词可以写成每个字母对应摩尔斯密码的组合。例如，"cab" 可以写成 "-.-..--..."，(即 "-.-." + ".-" + "-..." 字符串的结合)。我们将这样一个连接过程称作单词翻译。
# 返回我们可以获得所有词不同单词翻译的数量。

from typing import List

ms = [".-","-...","-.-.","-..",".","..-.","--.","....","..",".---","-.-",".-..","--","-.","---",".--.","--.-",".-.","...","-","..-","...-",".--","-..-","-.--","--.."]
class Solution:
    def uniqueMorseRepresentations(self, words: List[str]) -> int:
        res = set()
        for i in words:
            r = ""
            for s in i:
                r += ms[ord(s)-ord('a')]
            res.add(r)
        return len(res)



c = Solution()
print(c.uniqueMorseRepresentations(words = ["gin", "zen", "gig", "msg"]))